In [1]:
import pandas as pd

In [2]:
import numpy as np

In [9]:
labels = ['a','b','c']

In [10]:
my_data=[10,20,30]

In [11]:
arr=np.array(my_data)

In [12]:
arr

array([10, 20, 30])

In [13]:
d={'a':10,'b':20,'c':30}

In [14]:
d

{'a': 10, 'b': 20, 'c': 30}

In [15]:
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [16]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [17]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int32

In [18]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [19]:
pd.Series((print,sum)) #Holds references for build-in functions

0    <built-in function print>
1      <built-in function sum>
dtype: object

In [20]:
pd.Series(labels) #Holds labels as well

0    a
1    b
2    c
dtype: object

In [21]:
ser1=pd.Series([1,2,3,4],['USA','UK','Singapore','India'])
ser1

USA          1
UK           2
Singapore    3
India        4
dtype: int64

In [22]:
ser2=pd.Series([1,2,5,4],['USA','UK','Germany','India'])
ser2

USA        1
UK         2
Germany    5
India      4
dtype: int64

In [23]:
ser1[0]

1

In [24]:
ser3=pd.Series(data=labels)

In [25]:
ser3

0    a
1    b
2    c
dtype: object

In [26]:
ser3[0]

'a'

In [27]:
ser1+ser2

Germany      NaN
India        8.0
Singapore    NaN
UK           4.0
USA          2.0
dtype: float64

In [28]:
import numpy as np
import pandas as pd

In [29]:
from numpy.random import randn

In [30]:
np.random.seed(101)

In [31]:
np.random.randn(25)

array([ 2.70684984,  0.62813271,  0.90796945,  0.50382575,  0.65111795,
       -0.31931804, -0.84807698,  0.60596535, -2.01816824,  0.74012206,
        0.52881349, -0.58900053,  0.18869531, -0.75887206, -0.93323722,
        0.95505651,  0.19079432,  1.97875732,  2.60596728,  0.68350889,
        0.30266545,  1.69372293, -1.70608593, -1.15911942, -0.13484072])

In [32]:
df=pd.DataFrame(np.random.randn(5,5),['A','B','C','D','E'],['U','W','X','Y','Z'])

In [33]:
df

          U         W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406
C  0.484752 -0.116773  1.901755  0.238127  1.996652
D -0.993263  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846 -0.610259

In [34]:
df['W']

A    0.166905
B    0.329646
C   -0.116773
D    0.196800
E   -0.031579
Name: W, dtype: float64

In [35]:
df['U']

A    0.390528
B    0.638787
C    0.484752
D   -0.993263
E   -0.156598
Name: U, dtype: float64

In [36]:
type(df)

pandas.core.frame.DataFrame

In [37]:
df[['W','Z']]

          W         Z
A  0.166905  0.072960
B  0.329646 -0.943406
C -0.116773  1.996652
D  0.196800  1.025984
E -0.031579 -0.610259

In [38]:
df['new']=df['W']+df['Z']

In [39]:
df

          U         W         X         Y         Z       new
A  0.390528  0.166905  0.184502  0.807706  0.072960  0.239864
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406 -0.613760
C  0.484752 -0.116773  1.901755  0.238127  1.996652  1.879879
D -0.993263  0.196800 -1.136645  0.000366  1.025984  1.222784
E -0.156598 -0.031579  0.649826  2.154846 -0.610259 -0.641838

In [40]:
df.drop('new',1)

          U         W         X         Y         Z
A  0.390528  0.166905  0.184502  0.807706  0.072960
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406
C  0.484752 -0.116773  1.901755  0.238127  1.996652
D -0.993263  0.196800 -1.136645  0.000366  1.025984
E -0.156598 -0.031579  0.649826  2.154846 -0.610259

In [41]:
df

          U         W         X         Y         Z       new
A  0.390528  0.166905  0.184502  0.807706  0.072960  0.239864
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406 -0.613760
C  0.484752 -0.116773  1.901755  0.238127  1.996652  1.879879
D -0.993263  0.196800 -1.136645  0.000366  1.025984  1.222784
E -0.156598 -0.031579  0.649826  2.154846 -0.610259 -0.641838

In [42]:
df.drop('D',axis=0,inplace=True) #inplace - permanently deletes it

In [43]:
df

          U         W         X         Y         Z       new
A  0.390528  0.166905  0.184502  0.807706  0.072960  0.239864
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406 -0.613760
C  0.484752 -0.116773  1.901755  0.238127  1.996652  1.879879
E -0.156598 -0.031579  0.649826  2.154846 -0.610259 -0.641838

In [44]:
df.shape

(4, 6)

In [45]:
df.loc['A'] #based on the string

U      0.390528
W      0.166905
X      0.184502
Y      0.807706
Z      0.072960
new    0.239864
Name: A, dtype: float64

In [46]:
df.iloc[0] #Based on index position

U      0.390528
W      0.166905
X      0.184502
Y      0.807706
Z      0.072960
new    0.239864
Name: A, dtype: float64

In [47]:
#For selecting subsets of Rows and Columns
df.loc['B','X']

-0.49710402288933153

In [48]:
df.loc[['A','B','C'],['X','Y']] #Selecting subset of rows and columns

          X         Y
A  0.184502  0.807706
B -0.497104 -0.754070
C  1.901755  0.238127

In [49]:
booldf=df >0

In [50]:
df[booldf]

          U         W         X         Y         Z       new
A  0.390528  0.166905  0.184502  0.807706  0.072960  0.239864
B  0.638787  0.329646       NaN       NaN       NaN       NaN
C  0.484752       NaN  1.901755  0.238127  1.996652  1.879879
E       NaN       NaN  0.649826  2.154846       NaN       NaN

In [51]:
df[df>0]

          U         W         X         Y         Z       new
A  0.390528  0.166905  0.184502  0.807706  0.072960  0.239864
B  0.638787  0.329646       NaN       NaN       NaN       NaN
C  0.484752       NaN  1.901755  0.238127  1.996652  1.879879
E       NaN       NaN  0.649826  2.154846       NaN       NaN

In [52]:
df[df['W']>0] #Since this is passed as Series, No NULL/NaN values appear

          U         W         X         Y         Z       new
A  0.390528  0.166905  0.184502  0.807706  0.072960  0.239864
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406 -0.613760

In [53]:
df

          U         W         X         Y         Z       new
A  0.390528  0.166905  0.184502  0.807706  0.072960  0.239864
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406 -0.613760
C  0.484752 -0.116773  1.901755  0.238127  1.996652  1.879879
E -0.156598 -0.031579  0.649826  2.154846 -0.610259 -0.641838

In [54]:
df[df['Z']<0]

          U         W         X         Y         Z       new
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406 -0.613760
E -0.156598 -0.031579  0.649826  2.154846 -0.610259 -0.641838

In [55]:
df[df['W']>0]['Z']

A    0.072960
B   -0.943406
Name: Z, dtype: float64

In [56]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.184502  0.807706
B -0.497104 -0.754070

In [57]:
booleanseries=df['W']>0
result=df[booleanseries]
col=['X','Y']
result[col]
#Multiple lines

          X         Y
A  0.184502  0.807706
B -0.497104 -0.754070

In [58]:
df[(df['W']>0) & (df['X']<0)] #AND

          U         W         X        Y         Z      new
B  0.638787  0.329646 -0.497104 -0.75407 -0.943406 -0.61376

In [59]:
df[(df['W']>0) | (df['X']<0)] #OR

          U         W         X         Y         Z       new
A  0.390528  0.166905  0.184502  0.807706  0.072960  0.239864
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406 -0.613760

In [60]:
df.reset_index()

  index         U         W         X         Y         Z       new
0     A  0.390528  0.166905  0.184502  0.807706  0.072960  0.239864
1     B  0.638787  0.329646 -0.497104 -0.754070 -0.943406 -0.613760
2     C  0.484752 -0.116773  1.901755  0.238127  1.996652  1.879879
3     E -0.156598 -0.031579  0.649826  2.154846 -0.610259 -0.641838

In [61]:
df

          U         W         X         Y         Z       new
A  0.390528  0.166905  0.184502  0.807706  0.072960  0.239864
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406 -0.613760
C  0.484752 -0.116773  1.901755  0.238127  1.996652  1.879879
E -0.156598 -0.031579  0.649826  2.154846 -0.610259 -0.641838

In [62]:
newindex="PE RI PA AA".split()

In [63]:
df['Family']=newindex

In [64]:
df

          U         W         X         Y         Z       new Family
A  0.390528  0.166905  0.184502  0.807706  0.072960  0.239864     PE
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406 -0.613760     RI
C  0.484752 -0.116773  1.901755  0.238127  1.996652  1.879879     PA
E -0.156598 -0.031579  0.649826  2.154846 -0.610259 -0.641838     AA

In [65]:
df.set_index("Family") #Sets Family as the index to the dataframe
#Inplace = True if permanent change is required

               U         W         X         Y         Z       new
Family
PE      0.390528  0.166905  0.184502  0.807706  0.072960  0.239864
RI      0.638787  0.329646 -0.497104 -0.754070 -0.943406 -0.613760
PA      0.484752 -0.116773  1.901755  0.238127  1.996652  1.879879
AA     -0.156598 -0.031579  0.649826  2.154846 -0.610259 -0.641838

In [66]:
 df

          U         W         X         Y         Z       new Family
A  0.390528  0.166905  0.184502  0.807706  0.072960  0.239864     PE
B  0.638787  0.329646 -0.497104 -0.754070 -0.943406 -0.613760     RI
C  0.484752 -0.116773  1.901755  0.238127  1.996652  1.879879     PA
E -0.156598 -0.031579  0.649826  2.154846 -0.610259 -0.641838     AA

In [6]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [7]:
list(zip(outside,inside)) #Zip() returns a tuple

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [8]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [9]:
df=pd.DataFrame(np.random.randn(6,2),hier_index,['A','B'])

In [10]:
df

             A         B
G1 1  0.186281 -0.400331
   2  0.431902  0.153915
   3 -0.876581 -0.419076
G2 1  1.824050 -1.339759
   2 -0.401480  0.652818
   3 -1.131784 -0.126773

In [11]:
df.index.names=['Group','Number']

In [12]:
df

                     A         B
Group Number
G1    1       0.186281 -0.400331
      2       0.431902  0.153915
      3      -0.876581 -0.419076
G2    1       1.824050 -1.339759
      2      -0.401480  0.652818
      3      -1.131784 -0.126773

In [13]:
df.loc['G1'].loc[1]['B']

-0.4003314138683365

In [14]:
df.xs('G1')

               A         B
Number
1       0.186281 -0.400331
2       0.431902  0.153915
3      -0.876581 -0.419076

In [15]:
df.xs(['G1'])

               A         B
Number
1       0.186281 -0.400331
2       0.431902  0.153915
3      -0.876581 -0.419076

In [16]:
df.xs(1,level='Number')

              A         B
Group
G1     0.186281 -0.400331
G2     1.824050 -1.339759

In [17]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [18]:
df=pd.DataFrame(d)

In [19]:
df['A'].fillna(value=df['A'].mean()) #Setting to mean value

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [2]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [2]:
df=pd.DataFrame(data)

In [3]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [4]:
store=df.groupby('Company')

In [7]:
store.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [8]:
store.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [9]:
store.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [10]:
store.sum().loc['GOOG']

Sales    320
Name: GOOG, dtype: int64

In [32]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [33]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [36]:
df.groupby('Company').max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [37]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [38]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [11]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],
                 'B':['B0','B1','B2','B3'],
                 'C':['C0','C1','C2','C3'],
                 'D':['D0','D1','D2','D3']}, index=[0,1,2,3])

In [26]:
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],
                 'B':['B4','B5','B6','B7'],
                 'C':['C4','C5','C6','C7'],
                 'D':['D4','D5','D6','D7']}, index=[4,5,6,7])

In [27]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [28]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [29]:
pd.concat([df1,df2],axis=1)

     A    B    C    D    A    B    C    D
0   A0   B0   C0   D0  NaN  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN  NaN
2   A2   B2   C2   D2  NaN  NaN  NaN  NaN
3   A3   B3   C3   D3  NaN  NaN  NaN  NaN
4  NaN  NaN  NaN  NaN   A4   B4   C4   D4
5  NaN  NaN  NaN  NaN   A5   B5   C5   D5
6  NaN  NaN  NaN  NaN   A6   B6   C6   D6
7  NaN  NaN  NaN  NaN   A7   B7   C7   D7

In [56]:
pd.concat([df1,df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [15]:
left=pd.DataFrame({'key':['k0','k1','k2','k3'],
                  'C':['c0','c1','c2','c3'],
                  'D':['d0','d1','d2','d3']})

In [16]:
right=pd.DataFrame({'key':['k0','k1','k2','k3'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})

In [17]:
left

  key   C   D
0  k0  c0  d0
1  k1  c1  d1
2  k2  c2  d2
3  k3  c3  d3

In [18]:
right

  key   A   B
0  k0  A0  B0
1  k1  A1  B1
2  k2  A2  B2
3  k3  A3  B3

In [19]:
#KEY columns are the same, so Pandas has a function called Merging
pd.merge(right,left, how='inner',on='key')

  key   A   B   C   D
0  k0  A0  B0  c0  d0
1  k1  A1  B1  c1  d1
2  k2  A2  B2  c2  d2
3  k3  A3  B3  c3  d3

In [20]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})
center = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'E': ['E0', 'E1', 'E2', 'E3'],
                        'F': ['F0', 'F1', 'F2', 'F3']})

In [11]:
pd.merge(left,right,how='inner')#,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [22]:
pd.concat([left,right,center],axis=1)

  key1 key2   A   B key1 key2   C   D key1 key2   E   F
0   K0   K0  A0  B0   K0   K0  C0  D0   K0   K0  E0  F0
1   K0   K1  A1  B1   K1   K0  C1  D1   K0   K1  E1  F1
2   K1   K0  A2  B2   K1   K0  C2  D2   K1   K0  E2  F2
3   K2   K1  A3  B3   K2   K0  C3  D3   K2   K1  E3  F3

In [13]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [18]:
right.join(left)

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [19]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [21]:
left.join(right,how='outer') #Gives all combination

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [27]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']},index=[1,2,3,4])
df.head()

   col1  col2 col3
1     1   444  abc
2     2   555  def
3     3   666  ghi
4     4   444  xyz

In [7]:
df.set_index('col1')

      col2 col3
col1
1      444  abc
2      555  def
3      666  ghi
4      444  xyz

In [10]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [12]:
df['col2'].nunique()

3

In [14]:
df['col2'].value_counts()

444    2
666    1
555    1
Name: col2, dtype: int64

In [16]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
4     4   444  xyz

In [17]:
df['col1']>2

1    False
2    False
3     True
4     True
Name: col1, dtype: bool

In [23]:
def times2(x):
    return x*2
df[['col1','col2']].apply(times2)

   col1  col2
1     2   888
2     4  1110
3     6  1332
4     8   888

In [24]:
df.drop('col1',axis=1)

   col2 col3
1   444  abc
2   555  def
3   666  ghi
4   444  xyz

In [28]:
df.sort_values('col2')

   col1  col2 col3
1     1   444  abc
4     4   444  xyz
2     2   555  def
3     3   666  ghi

In [29]:
df.isnull()

    col1   col2   col3
1  False  False  False
2  False  False  False
3  False  False  False
4  False  False  False

In [30]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [31]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [34]:
df.pivot_table(values='D',index=['A','B'],columns='C').fillna(0)

C          x    y
A   B
bar one  4.0  1.0
    two  0.0  5.0
foo one  1.0  3.0
    two  2.0  0.0

In [33]:
df.fillna(0)

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1